In [35]:
#pandas join method
# data frame join is a convenient method for combining the columns of two potentially differently-indexed.
#Syntax: DataFrame.join()
# Parameters:
# other
# on
# how
# lsuffix
# rsuffix

In [36]:
import pandas as pd

In [54]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},index = ['a','b','c'])
df2 = pd.DataFrame({'A': [4,5],
                   'D': [40,50]},index = ['a','b'])
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50

In [43]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  30

In [44]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  30  3  30

In [46]:
df1.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [48]:
df1.join(df2)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  30

In [50]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [51]:
df1.join(df2, how = 'right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [52]:
df1.join(df2, how = 'inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [53]:
df1.join(df2, how = 'outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [56]:
df1.join(df2, lsuffix = '_1')

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [57]:
df1.join(df2, rsuffix = '_1')

   A   B  A_1     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN